In [1]:
import pandas as pd
import numpy as np


df=pd.DataFrame(np.arange(8).reshape(2,4),index=["one","three"],columns=["d","a","b","c"])

In [2]:
df

       d  a  b  c
one    0  1  2  3
three  4  5  6  7

In [3]:
df.sort_index()

       d  a  b  c
one    0  1  2  3
three  4  5  6  7

In [4]:
df.sort_index(axis=1)

       a  b  c  d
one    1  2  3  0
three  5  6  7  4

In [7]:
df.sort_values(by="c")

       d  a  b  c
one    0  1  2  3
three  4  5  6  7

In [8]:
df.sort_values(by=["a","b"])

       d  a  b  c
one    0  1  2  3
three  4  5  6  7

In [9]:
df.rank()

         d    a    b    c
one    1.0  1.0  1.0  1.0
three  2.0  2.0  2.0  2.0

In [12]:
obj=pd.Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [11]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [15]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [14]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [19]:
obj.rank(method)

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [21]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [20]:
obj.rank(method="dense")

0    5.0
1    1.0
2    5.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [26]:
obj1=pd.Series(range(5),index=["a","a","b","b","c"])
obj1

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [30]:
(obj1.index).is_unique

False

In [31]:
obj1["a"]

a    0
a    1
dtype: int64

In [32]:
obj1["c"]

4

In [33]:
obj6=pd.DataFrame(np.arange(12).reshape(4,3),index=["a","a","b","b"])
obj6

   0   1   2
a  0   1   2
a  3   4   5
b  6   7   8
b  9  10  11

In [35]:
obj6.loc["a"]

   0  1  2
a  0  1  2
a  3  4  5

In [36]:
obj6.loc["b"]

   0   1   2
b  6   7   8
b  9  10  11

In [42]:
df=pd.DataFrame([[1.40,np.NaN],[7.10,-4.5],[np.NaN,np.NaN],[0.75,-1.3]],index=["a","b","c","d"],columns=["one","two"])

In [43]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [44]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [45]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [46]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [50]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [53]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [54]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [83]:
import numpy as np 
df.argmax()               #The function argmax is only specific for Series

AttributeError: 'DataFrame' object has no attribute 'argmax'

In [55]:
df.idxmin()

one    d
two    b
dtype: object

In [56]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [57]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [64]:
obj=pd.Series(["a","a","b","c"])

In [80]:
obj.describe()

count     4
unique    3
top       a
freq      2
dtype: object

In [81]:
import numpy as np

a.argmax()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  This is separate from the ipykernel package so we can avoid doing imports until

'b'

In [66]:
a=df["one"]

In [74]:
a.describe()

count    3.000000
mean     3.083333
std      3.493685
min      0.750000
25%      1.075000
50%      1.400000
75%      4.250000
max      7.100000
Name: one, dtype: float64

In [84]:
df = pd.DataFrame({'consumption': [10.51, 103.11, 55.48],

                   'co2_emissions': [37.2, 19.66, 1712]},

                   index=['Pork', 'Wheat Products', 'Beef'])

In [85]:
df

                consumption  co2_emissions
Pork                  10.51          37.20
Wheat Products       103.11          19.66
Beef                  55.48        1712.00

In [86]:
df.idxmax(axis=1)

Pork              co2_emissions
Wheat Products      consumption
Beef              co2_emissions
dtype: object

In [87]:
df.idxmin()

consumption                Pork
co2_emissions    Wheat Products
dtype: object

In [88]:
df.idxmax()

consumption      Wheat Products
co2_emissions              Beef
dtype: object

In [89]:
df.quantile()

consumption      55.48
co2_emissions    37.20
Name: 0.5, dtype: float64